{"keras_version": "2.0.8", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Conv1D", "config": {"trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "conv1d_1", "kernel_size": [7], "use_bias": true, "kernel_regularizer": null, "dilation_rate": [1], "batch_input_shape": [null, null, 108], "dtype": "float32", "activation": "linear", "strides": [1], "activity_regularizer": null, "bias_regularizer": null, "filters": 128, "padding": "same", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "name": "batch_normalization_1", "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "axis": -1, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "center": true, "gamma_constraint": null, "momentum": 0.99, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001}}, {"class_name": "Conv1D", "config": {"trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "conv1d_2", "use_bias": true, "kernel_regularizer": null, "dilation_rate": [1], "activation": "linear", "strides": [1], "kernel_size": [5], "activity_regularizer": null, "bias_regularizer": null, "filters": 256, "padding": "same", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "name": "batch_normalization_2", "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "axis": -1, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "center": true, "gamma_constraint": null, "momentum": 0.99, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001}}, {"class_name": "Conv1D", "config": {"trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "conv1d_3", "use_bias": true, "kernel_regularizer": null, "dilation_rate": [1], "activation": "linear", "strides": [1], "kernel_size": [5], "activity_regularizer": null, "bias_regularizer": null, "filters": 256, "padding": "same", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "name": "batch_normalization_3", "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "axis": -1, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "center": true, "gamma_constraint": null, "momentum": 0.99, "beta_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001}}, {"class_name": "Bidirectional", "config": {"trainable": true, "layer": {"class_name": "GRU", "config": {"return_state": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "gru_1", "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "activation": "tanh", "units": 128, "activity_regularizer": null, "recurrent_activation": "hard_sigmoid", "go_backwards": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_constraint": null, "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "use_bias": true, "recurrent_regularizer": null, "stateful": false, "dropout": 0.2, "return_sequences": true, "recurrent_dropout": 0.0, "bias_regularizer": null, "unroll": false, "implementation": 0}}, "name": "bidirectional_1", "merge_mode": "concat"}}, {"class_name": "Bidirectional", "config": {"trainable": true, "layer": {"class_name": "GRU", "config": {"return_state": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "gru_2", "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "activation": "tanh", "units": 128, "activity_regularizer": null, "recurrent_activation": "hard_sigmoid", "go_backwards": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_constraint": null, "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "use_bias": true, "recurrent_regularizer": null, "stateful": false, "dropout": 0.2, "return_sequences": true, "recurrent_dropout": 0.0, "bias_regularizer": null, "unroll": false, "implementation": 0}}, "name": "bidirectional_2", "merge_mode": "concat"}}, {"class_name": "Bidirectional", "config": {"trainable": true, "layer": {"class_name": "GRU", "config": {"return_state": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "gru_3", "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "activation": "tanh", "units": 128, "activity_regularizer": null, "recurrent_activation": "hard_sigmoid", "go_backwards": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_constraint": null, "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "use_bias": true, "recurrent_regularizer": null, "stateful": false, "dropout": 0.2, "return_sequences": true, "recurrent_dropout": 0.0, "bias_regularizer": null, "unroll": false, "implementation": 0}}, "name": "bidirectional_3", "merge_mode": "concat"}}, {"class_name": "Bidirectional", "config": {"trainable": true, "layer": {"class_name": "GRU", "config": {"return_state": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "gru_4", "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "activation": "tanh", "units": 128, "activity_regularizer": null, "recurrent_activation": "hard_sigmoid", "go_backwards": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_constraint": null, "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "use_bias": true, "recurrent_regularizer": null, "stateful": false, "dropout": 0.2, "return_sequences": true, "recurrent_dropout": 0.0, "bias_regularizer": null, "unroll": false, "implementation": 0}}, "name": "bidirectional_4", "merge_mode": "concat"}}, {"class_name": "Bidirectional", "config": {"trainable": true, "layer": {"class_name": "GRU", "config": {"return_state": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "gru_5", "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "activation": "tanh", "units": 128, "activity_regularizer": null, "recurrent_activation": "hard_sigmoid", "go_backwards": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_constraint": null, "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "use_bias": true, "recurrent_regularizer": null, "stateful": false, "dropout": 0.2, "return_sequences": true, "recurrent_dropout": 0.0, "bias_regularizer": null, "unroll": false, "implementation": 0}}, "name": "bidirectional_5", "merge_mode": "concat"}}, {"class_name": "Bidirectional", "config": {"trainable": true, "layer": {"class_name": "GRU", "config": {"return_state": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "gru_6", "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "activation": "tanh", "units": 128, "activity_regularizer": null, "recurrent_activation": "hard_sigmoid", "go_backwards": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_constraint": null, "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "use_bias": true, "recurrent_regularizer": null, "stateful": false, "dropout": 0.4, "return_sequences": true, "recurrent_dropout": 0.0, "bias_regularizer": null, "unroll": false, "implementation": 0}}, "name": "bidirectional_6", "merge_mode": "concat"}}, {"class_name": "Bidirectional", "config": {"trainable": true, "layer": {"class_name": "GRU", "config": {"return_state": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "gru_7", "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "activation": "tanh", "units": 128, "activity_regularizer": null, "recurrent_activation": "hard_sigmoid", "go_backwards": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_constraint": null, "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "use_bias": true, "recurrent_regularizer": null, "stateful": false, "dropout": 0.4, "return_sequences": true, "recurrent_dropout": 0.0, "bias_regularizer": null, "unroll": false, "implementation": 0}}, "name": "bidirectional_7", "merge_mode": "concat"}}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "Dense", "config": {"trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "dense_1", "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "activation": "relu", "units": 256, "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, "name": "time_distributed_1"}}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.2}}, "name": "time_distributed_2"}}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "Dense", "config": {"trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "dense_2", "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "activation": "relu", "units": 256, "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, "name": "time_distributed_3"}}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "rate": 0.2}}, "name": "time_distributed_4"}}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "Dense", "config": {"trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "dense_3", "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "activation": "relu", "units": 128, "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, "name": "time_distributed_5"}}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "rate": 0.2}}, "name": "time_distributed_6"}}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "Dense", "config": {"trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "dense_4", "use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "activation": "softmax", "units": 48, "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, "name": "time_distributed_7"}}]}