{"class_name": "Sequential", "keras_version": "2.0.8", "backend": "tensorflow", "config": [{"class_name": "Bidirectional", "config": {"merge_mode": "concat", "trainable": true, "name": "bidirectional_1", "layer": {"class_name": "GRU", "config": {"return_state": false, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "activity_regularizer": null, "kernel_constraint": null, "return_sequences": true, "recurrent_regularizer": null, "units": 128, "unroll": false, "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "stateful": false, "implementation": 0, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "trainable": true, "recurrent_dropout": 0.0, "dropout": 0.2, "recurrent_constraint": null, "name": "gru_1", "activation": "tanh", "bias_regularizer": null, "kernel_regularizer": null}}, "dtype": "float32", "batch_input_shape": [null, null, 108]}}, {"class_name": "Bidirectional", "config": {"trainable": true, "layer": {"class_name": "GRU", "config": {"return_state": false, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "activity_regularizer": null, "kernel_constraint": null, "return_sequences": true, "recurrent_regularizer": null, "units": 128, "unroll": false, "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "stateful": false, "implementation": 0, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "trainable": true, "recurrent_dropout": 0.0, "dropout": 0.2, "recurrent_constraint": null, "name": "gru_2", "activation": "tanh", "bias_regularizer": null, "kernel_regularizer": null}}, "name": "bidirectional_2", "merge_mode": "concat"}}, {"class_name": "Bidirectional", "config": {"trainable": true, "layer": {"class_name": "GRU", "config": {"return_state": false, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "activity_regularizer": null, "kernel_constraint": null, "return_sequences": true, "recurrent_regularizer": null, "units": 128, "unroll": false, "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "stateful": false, "implementation": 0, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "trainable": true, "recurrent_dropout": 0.0, "dropout": 0.2, "recurrent_constraint": null, "name": "gru_3", "activation": "tanh", "bias_regularizer": null, "kernel_regularizer": null}}, "name": "bidirectional_3", "merge_mode": "concat"}}, {"class_name": "Bidirectional", "config": {"trainable": true, "layer": {"class_name": "GRU", "config": {"return_state": false, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "activity_regularizer": null, "kernel_constraint": null, "return_sequences": true, "recurrent_regularizer": null, "units": 128, "unroll": false, "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "stateful": false, "implementation": 0, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "trainable": true, "recurrent_dropout": 0.0, "dropout": 0.2, "recurrent_constraint": null, "name": "gru_4", "activation": "tanh", "bias_regularizer": null, "kernel_regularizer": null}}, "name": "bidirectional_4", "merge_mode": "concat"}}, {"class_name": "Bidirectional", "config": {"trainable": true, "layer": {"class_name": "GRU", "config": {"return_state": false, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "activity_regularizer": null, "kernel_constraint": null, "return_sequences": true, "recurrent_regularizer": null, "units": 128, "unroll": false, "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "stateful": false, "implementation": 0, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "trainable": true, "recurrent_dropout": 0.0, "dropout": 0.2, "recurrent_constraint": null, "name": "gru_5", "activation": "tanh", "bias_regularizer": null, "kernel_regularizer": null}}, "name": "bidirectional_5", "merge_mode": "concat"}}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "Dense", "config": {"bias_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "name": "dense_1", "units": 256, "bias_regularizer": null, "activation": "relu", "kernel_regularizer": null}}, "name": "time_distributed_1"}}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "name": "dropout_1"}}, "name": "time_distributed_2"}}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "Dense", "config": {"bias_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "name": "dense_2", "units": 256, "bias_regularizer": null, "activation": "relu", "kernel_regularizer": null}}, "name": "time_distributed_3"}}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "name": "dropout_2"}}, "name": "time_distributed_4"}}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "Dense", "config": {"bias_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "name": "dense_3", "units": 128, "bias_regularizer": null, "activation": "relu", "kernel_regularizer": null}}, "name": "time_distributed_5"}}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "name": "dropout_3"}}, "name": "time_distributed_6"}}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "Dense", "config": {"bias_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "name": "dense_4", "units": 48, "bias_regularizer": null, "activation": "softmax", "kernel_regularizer": null}}, "name": "time_distributed_7"}}]}